<a href="https://colab.research.google.com/github/ne-choi/textbook/blob/main/10_minutes_to_pandas/Pandas_10%EB%B6%84_%EC%99%84%EC%84%B1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas 10분 완성(10 Minutes to Pandas) 필사**
**출처: 데잇걸즈2 번역 자료**

**목차**
1. Object Creation (객체 생성)  
2. Viewing Data (데이터 확인하기)  
3. Selection (선택)  
4. Missing Data (결측치)  
5. Operation (연산)  
6. Merge (병합)
7. Grouping (그룹화)
8. Reshaping (변형)
9. Time Series (시계열)
10. Categoricals (범주화)
11. Plotting (그래프)
12. Getting Data In / Out (데이터 입 / 출력)
13. Gotchas (잡았다!)

In [2]:
# 패키지 불러오기

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## **1. Object Creation**
[- 참고: 데이터 구조 소개 섹션](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html)

Pansdas는 값을 가지고 있는 리스트를 통해 [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html)를 만들고, 정수로 만들어진 인덱스를 기본값으로 불러온다.

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

datetime 인덱스와 레이블이 있는 열을 가진 numpy 배열을 전달하여 데이터프레임을 만든다.

In [4]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.602200  1.371136 -0.871471 -1.369219
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967
2013-01-04  0.335354 -0.226875 -0.052475  1.137469
2013-01-05  1.743132 -0.457479  0.044569 -0.500767
2013-01-06 -0.048809 -2.437072 -0.376757  2.254009

Series와 같은 것으로 변환될 수 있는 객체들의 dict로 구성된 데이터프레임을 만든다.

In [6]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index = list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

## **2. Viewing Data**
[- 참고: Basic Section](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html)  

데이터프레임의 가장 윗줄과 마지막 줄을 확인하고 싶을 때 사용하는 방법 알아보기.

In [8]:
# 괄호() 안에 숫자를 넣으면 (숫자)줄을 불러오고 넣지 않으면 기본값인 5개를 불러옴

df.tail(3)

                   A         B         C         D
2013-01-04  0.335354 -0.226875 -0.052475  1.137469
2013-01-05  1.743132 -0.457479  0.044569 -0.500767
2013-01-06 -0.048809 -2.437072 -0.376757  2.254009

In [9]:
df.head()

                   A         B         C         D
2013-01-01  0.602200  1.371136 -0.871471 -1.369219
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967
2013-01-04  0.335354 -0.226875 -0.052475  1.137469
2013-01-05  1.743132 -0.457479  0.044569 -0.500767

index, column, numpy 데이터 세부 정보를 알아보자.

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[ 0.60219964,  1.37113554, -0.8714707 , -1.36921855],
       [ 0.4796801 , -0.06016503,  0.48253603,  0.35878569],
       [-0.4392807 , -0.9391977 ,  1.36642825, -1.84596652],
       [ 0.33535393, -0.22687458, -0.0524749 ,  1.13746926],
       [ 1.74313218, -0.45747899,  0.04456915, -0.50076714],
       [-0.04880899, -2.43707208, -0.37675697,  2.25400944]])

In [13]:
df.describe() # 데이터의 대략적인 통계적 정보 요약을 보여줌

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.445379 -0.458275  0.098805  0.005719
std    0.741469  1.241427  0.767794  1.551518
min   -0.439281 -2.437072 -0.871471 -1.845967
25%    0.047232 -0.818768 -0.295686 -1.152106
50%    0.407517 -0.342177 -0.003953 -0.070991
75%    0.571570 -0.101842  0.373044  0.942798
max    1.743132  1.371136  1.366428  2.254009

In [14]:
df.T # 데이터 전치

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.602200    0.479680   -0.439281    0.335354    1.743132   -0.048809
B    1.371136   -0.060165   -0.939198   -0.226875   -0.457479   -2.437072
C   -0.871471    0.482536    1.366428   -0.052475    0.044569   -0.376757
D   -1.369219    0.358786   -1.845967    1.137469   -0.500767    2.254009

In [15]:
df.sort_index(axis = 1, ascending = False) # 축별로 정리

                   D         C         B         A
2013-01-01 -1.369219 -0.871471  1.371136  0.602200
2013-01-02  0.358786  0.482536 -0.060165  0.479680
2013-01-03 -1.845967  1.366428 -0.939198 -0.439281
2013-01-04  1.137469 -0.052475 -0.226875  0.335354
2013-01-05 -0.500767  0.044569 -0.457479  1.743132
2013-01-06  2.254009 -0.376757 -2.437072 -0.048809

In [16]:
df.sort_values(by = 'B') # 값별로 정렬

                   A         B         C         D
2013-01-06 -0.048809 -2.437072 -0.376757  2.254009
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967
2013-01-05  1.743132 -0.457479  0.044569 -0.500767
2013-01-04  0.335354 -0.226875 -0.052475  1.137469
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-01  0.602200  1.371136 -0.871471 -1.369219

## **3. Selection**  
* 주석: Pandas에 최적화된 데이터 접근 방법인 .at, .iat, .loc, .iloc 사용  

[- 참고: 데이터 인덱싱 및 선택](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html), [다중 인덱싱/심화 인덱싱](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html)

### *** Getting(데이터 얻기)**  
df.A와 동일한 Series를 생성하는 단일 열을 선택한다.

In [17]:
df['A']

2013-01-01    0.602200
2013-01-02    0.479680
2013-01-03   -0.439281
2013-01-04    0.335354
2013-01-05    1.743132
2013-01-06   -0.048809
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  0.602200  1.371136 -0.871471 -1.369219
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967

In [19]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967
2013-01-04  0.335354 -0.226875 -0.052475  1.137469

### *** Selection by Label**  
[- 참고: Label을 통한 선택](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)

In [20]:
# 라벨을 사용하여 횡단면 얻기
df.loc[dates[0]]

A    0.602200
B    1.371136
C   -0.871471
D   -1.369219
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
# 라벨을 사용하여 여러 축(의 데이터) 얻기
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.602200  1.371136
2013-01-02  0.479680 -0.060165
2013-01-03 -0.439281 -0.939198
2013-01-04  0.335354 -0.226875
2013-01-05  1.743132 -0.457479
2013-01-06 -0.048809 -2.437072

In [22]:
# 양쪽 종단점을 포함한 라벨 슬라이싱 보기
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.479680 -0.060165
2013-01-03 -0.439281 -0.939198
2013-01-04  0.335354 -0.226875

In [23]:
# 반환되는 객체의 차원 줄이기
df.loc['20130102', ['A', 'B']]

A    0.479680
B   -0.060165
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
# 스킬라 값 얻기
df.loc[dates[0], 'A']

0.6021996423517318

In [25]:
# cf. 스킬라 값 더 빠르게 구하는 법
df.at[dates[0], 'A']

0.6021996423517318

### *** Selection by Position**  
[- 참고: 위치로 선택하기](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)

In [26]:
# 넘겨 받은 정수 위치를 기준으로 선택
df.iloc[3]

A    0.335354
B   -0.226875
C   -0.052475
D    1.137469
Name: 2013-01-04 00:00:00, dtype: float64

In [27]:
# 정수로 표기된 슬라이스를 통해, numpy / python과 유사하게 작동
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.335354 -0.226875
2013-01-05  1.743132 -0.457479

In [28]:
# 정수로 표기된 위치값 리스트를 통해, numpy / python 스타일과 유사해짐
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.479680  0.482536
2013-01-03 -0.439281  1.366428
2013-01-05  1.743132  0.044569

In [29]:
# 명시적으로 행을 나누고자 하는 경우
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967

In [30]:
# 명시적으로 열을 나누고자 하는 경우
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.371136 -0.871471
2013-01-02 -0.060165  0.482536
2013-01-03 -0.939198  1.366428
2013-01-04 -0.226875 -0.052475
2013-01-05 -0.457479  0.044569
2013-01-06 -2.437072 -0.376757

In [33]:
# 명시적으로 (특정한) 값을 얻고자 하는 경우
df.iloc[1, 1]

-0.060165025555384645

In [37]:
# 스칼라 값을 빠르게 얻는 방법
df.iat[1, 1]

-0.060165025555384645

### *** Boolean Indexing**
데이터를 선택하기 위해 단일 열 값을 사용한다.

In [38]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.602200  1.371136 -0.871471 -1.369219
2013-01-02  0.479680 -0.060165  0.482536  0.358786
2013-01-04  0.335354 -0.226875 -0.052475  1.137469
2013-01-05  1.743132 -0.457479  0.044569 -0.500767

In [40]:
# Boolean 조건을 충족하는 데이터프레임에서 값 선택
df[df > 0]

                   A         B         C         D
2013-01-01  0.602200  1.371136       NaN       NaN
2013-01-02  0.479680       NaN  0.482536  0.358786
2013-01-03       NaN       NaN  1.366428       NaN
2013-01-04  0.335354       NaN       NaN  1.137469
2013-01-05  1.743132       NaN  0.044569       NaN
2013-01-06       NaN       NaN       NaN  2.254009

In [42]:
# 필터링을 위한 메소드 isin()을 사용
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.602200  1.371136 -0.871471 -1.369219    one
2013-01-02  0.479680 -0.060165  0.482536  0.358786    one
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967    two
2013-01-04  0.335354 -0.226875 -0.052475  1.137469  three
2013-01-05  1.743132 -0.457479  0.044569 -0.500767   four
2013-01-06 -0.048809 -2.437072 -0.376757  2.254009  three

In [43]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.439281 -0.939198  1.366428 -1.845967   two
2013-01-05  1.743132 -0.457479  0.044569 -0.500767  four

### *** Setting**
새 열을 설정하면 데이터가 인덱스별로 자동정렬 된다.

In [45]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [47]:
df['F'] = s1

In [49]:
# 라벨에 의해 값 설정
df.at[dates[0], 'A'] = 0

In [50]:
# 위치에 의해 값 설정
df.iat[0, 1] = 0

In [52]:
# Numpy 배열을 사용한 할당에 의해 값 설정
df.loc[:, 'D'] = np.array([5] * len(df))

In [54]:
# 위 설정대로 작동한 결과
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.871471  5  NaN
2013-01-02  0.479680 -0.060165  0.482536  5  1.0
2013-01-03 -0.439281 -0.939198  1.366428  5  2.0
2013-01-04  0.335354 -0.226875 -0.052475  5  3.0
2013-01-05  1.743132 -0.457479  0.044569  5  4.0
2013-01-06 -0.048809 -2.437072 -0.376757  5  5.0

In [55]:
# where 연산 설정
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.871471 -5  NaN
2013-01-02 -0.479680 -0.060165 -0.482536 -5 -1.0
2013-01-03 -0.439281 -0.939198 -1.366428 -5 -2.0
2013-01-04 -0.335354 -0.226875 -0.052475 -5 -3.0
2013-01-05 -1.743132 -0.457479 -0.044569 -5 -4.0
2013-01-06 -0.048809 -2.437072 -0.376757 -5 -5.0

## **4. Missing Data**
Pandas는 결측치를 표현하기 위해, 주로 np.nan 값을 사용한다. (기본 설정값이나 계산에는 포함되지 않음)  
[- 참고: Missing data section](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html)  

Reindexing으로 지정된 축 상의 인덱스를 변경/추가/삭제할 수 있다. Reindexing은 데이터의 복사본을 반환한다.

In [58]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.871471  5  NaN  1.0
2013-01-02  0.479680 -0.060165  0.482536  5  1.0  1.0
2013-01-03 -0.439281 -0.939198  1.366428  5  2.0  NaN
2013-01-04  0.335354 -0.226875 -0.052475  5  3.0  NaN

In [57]:
# 결측치를 가지고 있는 행 지우기
df1.dropna(how = 'any')

                  A         B         C  D    F    E
2013-01-02  0.47968 -0.060165  0.482536  5  1.0  1.0

In [59]:
# 결측치 채워 넣기
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.871471  5  5.0  1.0
2013-01-02  0.479680 -0.060165  0.482536  5  1.0  1.0
2013-01-03 -0.439281 -0.939198  1.366428  5  2.0  5.0
2013-01-04  0.335354 -0.226875 -0.052475  5  3.0  5.0

In [ ]:
# NAN 값에 boolean을 통한 표식
pd.isna(df1) # 데이터프레임의 모든 값이 boolean 형태로 표시되게 하며, nan인 값만 True가 표시되게 하는 함수

## **5. Operation (연산)**
[- 참고: 이진(Binary) 연산의 기본 섹션](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html)  

### *** Stats**
통계: 일반적으로 결측치를 제외한 후 연산된다.

In [61]:
# 기술통계 수행
df.mean()

A    0.345013
B   -0.686798
C    0.098805
D    5.000000
F    3.000000
dtype: float64

In [63]:
# 다른 축에서 동일한 연산 수행
df.mean(1)

2013-01-01    1.032132
2013-01-02    1.380410
2013-01-03    1.397590
2013-01-04    1.611201
2013-01-05    2.066044
2013-01-06    1.427472
Freq: D, dtype: float64

In [65]:
# 정렬이 필요하며, 차원이 다른 객체로 연산 (pandas는 지정된 차원을 따라 자동으로 브로드캐스팅됨)
# broadcast: nympy에서 유래, n차원이나 스칼라 값으로 연산 수행 시 도출되는 결과의 규칙을 설명하는 것  
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [67]:
df.sub(s, axis = 'index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.439281 -1.939198  0.366428  4.0  1.0
2013-01-04 -2.664646 -3.226875 -3.052475  2.0  0.0
2013-01-05 -3.256868 -5.457479 -4.955431  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

### *** Apply**

In [69]:
# 데이터에 함수 적용
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -0.871471   5   NaN
2013-01-02  0.479680 -0.060165 -0.388935  10   1.0
2013-01-03  0.040399 -0.999363  0.977494  15   3.0
2013-01-04  0.375753 -1.226237  0.925019  20   6.0
2013-01-05  2.118886 -1.683716  0.969588  25  10.0
2013-01-06  2.070077 -4.120788  0.592831  30  15.0

In [70]:
df.apply(lambda x: x.max() - x.min())

A    2.182413
B    2.437072
C    2.237899
D    0.000000
F    4.000000
dtype: float64

### *** Histogramming**
[- 참고: Histogramming and Discretization(히스토그래밍과 이산화)](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html)

In [72]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    2
1    3
2    3
3    0
4    4
5    4
6    6
7    5
8    0
9    1
dtype: int64

In [73]:
s.value_counts

<bound method IndexOpsMixin.value_counts of 0    2
1    3
2    3
3    0
4    4
5    4
6    6
7    5
8    0
9    1
dtype: int64>

### *** String Methods**
Series는 문자열 처리 메소드 모음(set)을 가지고 있다.  
이 모음은 배열의 각 요소를 쉽게 조작하도록 만드는 문자열의 속성에 포함되어 있다.  
문자열의 패턴 일치 확인은 기본적으로 정규 표현식을 사용하며, 몇몇 경우에는 항상 정규 표현식을 사용한다.  

[- 참고: 벡터화된 문자열 메소드](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)

In [74]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## **6. Merge**  

### *** Concat (연결)**
결합(join)/병합(merge) 형태의 연산에 관한 인덱스, 관계 대수 기능을 위한 다양한 형태의 논리를 포함한 Series, 데이터프레임, Panel 객체를 손쉽게 결합하는 기능이 있다.  

[- 참고: Merging](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

In [76]:
# concat()으로 pandas 객체 연결
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.954296 -0.781050 -1.819922 -0.523274
1  3.050933  0.503699 -0.394346  0.061156
2 -0.740626  1.227093 -0.941005 -0.159871
3  0.465618  1.112706 -0.434825  0.683227
4 -0.955076  0.734717  0.478459 -0.121397
5 -0.456095 -1.027444  1.347533 -0.119972
6  2.091093 -0.850402  0.856106 -0.017487
7 -0.771944 -1.924458 -2.225448  0.063593
8  0.638077 -1.526856  0.046085  0.967843
9 -1.242453  0.136737  0.394506  1.319932

In [77]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pd.concat(pieces)

          0         1         2         3
0  0.954296 -0.781050 -1.819922 -0.523274
1  3.050933  0.503699 -0.394346  0.061156
2 -0.740626  1.227093 -0.941005 -0.159871
3  0.465618  1.112706 -0.434825  0.683227
4 -0.955076  0.734717  0.478459 -0.121397
5 -0.456095 -1.027444  1.347533 -0.119972
6  2.091093 -0.850402  0.856106 -0.017487
7 -0.771944 -1.924458 -2.225448  0.063593
8  0.638077 -1.526856  0.046085  0.967843
9 -1.242453  0.136737  0.394506  1.319932

### *** Join**
SQL 방식으로 병합한다.  
[- 참고: 데이터베이스 스타일 결합](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

In [79]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

   key  lval
0  foo     1
1  foo     2

In [82]:
left

   key  lval
0  foo     1
1  foo     2

In [83]:
right

   key  rval
0  foo     4
1  foo     5

In [84]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [87]:
# 다른 예시
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [89]:
left

   key  lval
0  foo     1
1  bar     2

In [91]:
right

   key  rval
0  foo     4
1  bar     5

In [92]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### *** Append (추가)**
데이터프레임에 행을 추가한다.  
[- 참고: Appending](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

In [94]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ['A', 'B', 'C', 'D'])
df

          A         B         C         D
0  1.084682 -0.070600 -0.253510 -0.543952
1 -0.508307  0.488164 -0.383926  0.319728
2 -0.643389  0.574200 -2.010267 -0.228498
3 -0.425625 -1.047864 -0.384171  1.248674
4  1.714311  0.948370 -1.328857  0.527210
5 -0.062034  0.907521  0.264906  1.020753
6  0.900050 -1.708019  1.219485  0.087306
7 -1.602747 -0.095129  0.279006 -0.274761

In [95]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  1.084682 -0.070600 -0.253510 -0.543952
1 -0.508307  0.488164 -0.383926  0.319728
2 -0.643389  0.574200 -2.010267 -0.228498
3 -0.425625 -1.047864 -0.384171  1.248674
4  1.714311  0.948370 -1.328857  0.527210
5 -0.062034  0.907521  0.264906  1.020753
6  0.900050 -1.708019  1.219485  0.087306
7 -1.602747 -0.095129  0.279006 -0.274761
8 -0.425625 -1.047864 -0.384171  1.248674

## **7. Grouping**
그룹화는 다음 단계 중 하나 이상을 포함하는 과정을 말한다.  
- 몇몇 기준에 따라 여러 그룹으로 데이터를 분할(splitting)  
- 각 그룹에 독립적으로 함수를 적용(applying)  
- 결과물을 하나의 데이터 구조로 결합(combining)  

[- 참고: 그룹화](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html)

In [97]:
df = pd.DataFrame(
    {
        'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C': np.random.randn(8),
        'D': np.random.randn(8)
    })

df

     A      B         C         D
0  foo    one  0.127550  0.426812
1  bar    one  1.463203 -0.112034
2  foo    two -1.096286 -2.066998
3  bar  three  0.717795  0.022521
4  foo    two  0.577328 -0.458582
5  bar    two -0.666696  0.875146
6  foo    one  0.784724  0.727839
7  foo  three -1.315582  0.033259

In [99]:
# 생성된 데이터프레임을 그룹화한 후, 각 그룹에 sum() 함수 적용
df.groupby('A').sum()

            C         D
A
bar  1.514301  0.785634
foo -0.922266 -1.337669

In [101]:
# 여러 열을 기준으로 그룹화하면 계층적 인덱스가 형성, 여기에도 sum 함수 적용 가능
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    1.463203 -0.112034
    three  0.717795  0.022521
    two   -0.666696  0.875146
foo one    0.912275  1.154652
    three -1.315582  0.033259
    two   -0.518958 -2.525580

## **8. Reshaping**
[- 참고: 계층적 인덱싱](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html), [변형](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html)  

### *** Stack**

In [102]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

index = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     1.462362  0.279302
      two     0.208123  0.321943
baz   one     0.603123  1.159705
      two    -0.303194  0.449072

In [103]:
# stack() 메소드는 데이터프레임 열들의 계층을 압축
stacked = df2.stack()
stacked

first  second
bar    one     A    1.462362
               B    0.279302
       two     A    0.208123
               B    0.321943
baz    one     A    0.603123
               B    1.159705
       two     A   -0.303194
               B    0.449072
dtype: float64

In [104]:
# Stack된 데이터프레임 또는 MultiIndex를 인덱스로 사용하는 Series인 경우,
# stack()의 역연산은 unstack()이며 기본적으로 마지막 계층을 unstack함
stacked.unstack()

                     A         B
first second
bar   one     1.462362  0.279302
      two     0.208123  0.321943
baz   one     0.603123  1.159705
      two    -0.303194  0.449072

In [106]:
stacked.unstack(1)

second        one       two
first
bar   A  1.462362  0.208123
      B  0.279302  0.321943
baz   A  0.603123 -0.303194
      B  1.159705  0.449072

In [107]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.462362  0.603123
       B  0.279302  1.159705
two    A  0.208123 -0.303194
       B  0.321943  0.449072

### *** Pivot Tables**
[- 참고: 피봇 테이블](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html)

In [109]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

df

        A  B    C         D         E
0     one  A  foo -0.961524 -0.951220
1     one  B  foo -1.923503 -1.090603
2     two  C  foo -0.020461 -1.116490
3   three  A  bar -1.059653  0.760512
4     one  B  bar  0.314818  2.878347
5     one  C  bar -0.299760 -0.699511
6     two  A  foo -0.131890  0.061934
7   three  B  foo  0.671623  0.282510
8     one  C  foo  1.227755  1.016659
9     one  A  bar  0.187799  0.114970
10    two  B  bar  1.673849  1.462893
11  three  C  bar  1.489136 -0.770863

In [110]:
# 피봇 테이블 생성
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.187799 -0.961524
      B  0.314818 -1.923503
      C -0.299760  1.227755
three A -1.059653       NaN
      B       NaN  0.671623
      C  1.489136       NaN
two   A       NaN -0.131890
      B  1.673849       NaN
      C       NaN -0.020461

## **9. Time Series**
Pandas는 자주 일어나는 변환(ex. 5분마다 일어나는 데이터의 2차 데이터 변환) 사이에 수행하는 리샘플링 연산을 위해 간단하고 강력하고 효율적인 함수를 제공한다.  
재무(금융) 응용에서 매우 일반적이나 이에 국한되지는 않는다.  
[- 참고: 시계열](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html)

In [112]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts.resample('5Min').sum()

2012-01-01    23629
Freq: 5T, dtype: int64

In [114]:
# 시간대 표현
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    1.241040
2012-03-07   -1.181655
2012-03-08   -0.007886
2012-03-09    0.018150
2012-03-10    0.504525
Freq: D, dtype: float64

In [115]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-06 00:00:00+00:00    1.241040
2012-03-07 00:00:00+00:00   -1.181655
2012-03-08 00:00:00+00:00   -0.007886
2012-03-09 00:00:00+00:00    0.018150
2012-03-10 00:00:00+00:00    0.504525
Freq: D, dtype: float64

In [116]:
# 다른 시간대로 변환
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    1.241040
2012-03-06 19:00:00-05:00   -1.181655
2012-03-07 19:00:00-05:00   -0.007886
2012-03-08 19:00:00-05:00    0.018150
2012-03-09 19:00:00-05:00    0.504525
Freq: D, dtype: float64

In [118]:
# 시간 표현 ↔ 기간 표현 변환
rng = pd.date_range('1/1/2012', periods=5, freq='M')
ts = pd.Series(np.random.randn(len(rng)), index=rng)
ts

2012-01-31   -1.912311
2012-02-29   -0.263301
2012-03-31   -0.057735
2012-04-30   -0.763615
2012-05-31    0.075798
Freq: M, dtype: float64

In [119]:
ps = ts.to_period()
ps

2012-01   -1.912311
2012-02   -0.263301
2012-03   -0.057735
2012-04   -0.763615
2012-05    0.075798
Freq: M, dtype: float64

In [120]:
ps.to_timestamp()

2012-01-01   -1.912311
2012-02-01   -0.263301
2012-03-01   -0.057735
2012-04-01   -0.763615
2012-05-01    0.075798
Freq: MS, dtype: float64

기간 ↔ 시간 변환은 편리한 산술 기능을 사용할 수 있도록 만든다.  
11월에 끝나는 연말 결산의 분기별 빈도를, 분기말 익월의 월말일 오전 9시로 변환해보자.

In [122]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 'S')
ts.head()

1990-03-01 00:00   -0.689608
1990-06-01 00:00   -0.639076
1990-09-01 00:00   -1.612070
1990-12-01 00:00   -0.785382
1991-03-01 00:00   -0.865252
Freq: H, dtype: float64